[
  {
    "index": 0,
    "id": "1-ora",
    "title": "The Offroad Adventure Show e-Magazine",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1718878622/1-ora/ipltvvjasu1r3jbgbwmo.png",
    "imageWide": "/assets/projects/1-ora/ORA-WIDE.png",
    "description": "This e-magazine was created to be a direct reflection of the Chanel 10 TV series ‘The Offroad Adventure Show’. The series follows a crew of 4WDers who explore Australia traversing some of its toughest and most unforgiving destinations. I was fortunate enough to be able to design and publish issue #2, issue #3, and issue #4 of the season 8 editions of the e-magazine. Each issue was roughly 80 pages long. \n\n For these e-magazines, I was supplied with copy, images, and video clips, and given complete freedom to layout all elements in a way that guided the reader from beginning to end. Important considerations I had to abide by during this process were making sure that the layout of the elements did justice to the story being told, and that the design was consistent with the branding of the show and previous magazines. \n\n To accompany the magazines, I created a collateral of promotional material that was used to promote the publications through EDMS and social media.",
    "color": "#FFFFFF"
  },
  {
    "index": 1,
    "id": "2-imagemaker",
    "title": "Imagemaker Print Studio",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1718878577/2-imagemaker/knsugtuoaiv4pfgefpnl.png",
    "imageWide": "/assets/projects/2-imagemaker/IMAGEMAKER-WIDE.png",
    "description": "A new Melbourne-based fine art and photography printing company approached me with a branding opportunity. This was primarily a logo design, with a focus on a versatile brand mark. \n\n For the primary logo, we used a typography-based design with an emphasis on strength and trust. These concepts are conveyed through the tight kerning of the lettering, as well as the bold yet sharp nature of the font. \n\n For the brand mark, we used a camera shutter vector as a reference back to the nature of the business; a fine art and photography printing service. As the primary logo is wider, this icon is a more versatile option for certain contexts that may not be ideal for the text logo.",
    "color": "#FFFFFF"
  },
  {
    "index": 2,
    "id": "3-taituivasa",
    "title": "Tai Tuivasa Merchandise Design",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1719306603/taituivasa-square-comp_vhtgkt.png",
    "imageWide": "/assets/projects/3-taituivasa/TUIVASA-WIDE.png",
    "description": "This is a project I worked on in collaboration with UFC heavyweight Tai ‘Bam Bam’ Tuivasa. His management reached out with the possibility of designing some merchandise for him. I wanted to create something suitable for everyday wear, while still representing the nature of Tai’s sport; mixed martial arts. \n\n Due to timing issues, these designs never made it to print. However, this was a fantastic opportunity for me to work with a public figure who I admire like Tai, and gain experience in a realm of design that was somewhat foreign to me.",
    "color": "#FFFFFF"
  },
  {
    "index": 3,
    "id": "4-royalbotanicgardens",
    "title": "Royal Botanic Gardens Annual Report",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1719306893/ROYALBOTANICGARDENS-SQUARE-comp_k8n5i7.png",
    "imageWide": "/assets/projects/4-royalbotanicgardens/ROYALBOTANICGARDENS-WIDE.png",
    "description": "This Annual Report aims to juxtapose the exquisite charm of the Royal Botanical Gardens with the typically mundane nature of an annual report. The black-and-white visuals deliberately contrast with the vibrant, real-life spectacle of the gardens, symbolizing the presentation of business data and information. \n\nThroughout the document, the inclusion of full-page photographs serves as a breathing point for readers amidst the information-heavy content. This is a project I completed in 2019, and is what founded my passion for publication and layout design.",
    "color": "#FFFFFF"
  },
  {
    "index": 4,
    "id": "5-melbournecomedyfestival",
    "title": "Melbourne Comedy Festival Poster",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1719306772/comedyfestival-square-comp_lxox5p.png",
    "imageWide": "/assets/projects/5-melbournecomedyfestival/comedyfestival-wide.png",
    "description": "With the aim of highlighting and refining our typographic expertise, I undertook the challenge of crafting a poster for the Melbourne Comedy Festival. The objective was to capture the lively and cheerful essence of the event. The unconventional, curved lines and the layered arrangement of the lettering effectively fulfill this mandate, ensuring a design that not only aligns with the festivity but also maintains readability.",
    "color": "#FFFFFF"
  },
  {
    "index": 5,
    "id": "6-downunderjourney",
    "title": "What’s Up Downunder Journey e-Magazine",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1719306826/journey-square-min-comp_qirowj.png",
    "imageWide": "/assets/projects/6-downunderjourney/journey-wide.png",
    "description": "This e-magazine is designed to directly reflect 4 episodes of  'What’s Up Downunder' a Chanel 10 TV series airing most Saturdays that follows the adventures of the WUDU crew, including personalities like Craig ‘Macca’ McGowan and Robbie Nethercote, as they explore Australia’s best tourist destinations. \n\n The '2023 Trip of a Lifetime' issue chronicles four groups of influencers traveling with our hosts, from Apollo Bay to the Murray River. \n\n I had the privilege of collaborating with fellow designer Neil Tulloch to develop this close-to-100-page publication. During this process, we were provided with copy, images, and video clips, and given complete creative freedom to arrange elements seamlessly from start to finish. The Journey magazine boasts a minimalist style, incorporating bold headings to captivate readers. Maintaining a cohesive design was crucial to the editor, Leanne O’Neill, and I believe we successfully achieved this harmonious flow between the two designers. ",
    "color": "#FFFFFF"
  },
  {
    "index": 6,
    "id": "7-ctl",
    "title": "Camper Trailer Lifestyle Monthly e-Magazine",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1718962702/CTL-SQUARE-min_zygdbd.png",
    "imageWide": "/assets/projects/7-ctl/CTL-WIDE.png",
    "description": "The Camper Trailer Lifestyle monthly e-magazine delves into the realms of camping, off-roading, and exploration across Australia. Since January 2022, I have been actively involved in the design, compilation, and publication of this engaging e-magazine on a monthly basis. \n\n In the creation of these e-magazines, I was supplied with content including copy, images, and video clips. With full creative freedom, I meticulously structured all elements to guide the reader seamlessly from the beginning to the end. Throughout this process, I prioritized ensuring that the layout complemented the articles, doing justice to the content provided, and maintaining design consistency with the branding that had been established in previous issues. \n\n To enhance the reach of the magazines, I developed a comprehensive set of promotional materials. These collateral pieces were strategically employed to promote the publications through email marketing, and various social media platforms.",
    "color": "#FFFFFF"
  },
  {
    "index": 7,
    "id": "8-jimmychews",
    "title": "Jimmy Chews",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1718878575/8-jimmychews/rjg6hkx2sfr2rns3ryht.png",
    "imageWide": "/assets/projects/8-jimmychews/JIMMY-WIDE.png",
    "description": "When the chance arose to collaborate with the emerging food and cooking influencer 'Jimmy Chews,' I was extremely enthusiastic about the opportunity. Tasked with crafting a logo/brandmark for their Instagram profile, one with versatility for use across different mediums and contexts, I embraced the challenge. \n\n The client's brief was clear - they sought a logo that seamlessly blended fun and style. Intriguingly, the influencer's content featured a diverse range of music from the 1960s, serving as inspiration for us to explore a retro diner logo aesthetic. The fusion of these two concepts not only aligned seamlessly but also gave rise to a compelling and cohesive brand identity, signaling a promising future for 'Jimmy Chews.' \n\n For a taste of 'Jimmy Chews' culinary delights, feel free to explore their Instagram page and indulge in some delicious recipes.",
    "color": "#FFFFFF"
  },
  {
    "index": 8,
    "id": "9-happyhomes",
    "title": "UNIVERSITY PROJECT: Happy Homes Branding Collateral",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1718962782/HAPPY-SQUARE-min_p1bjli.png",
    "imageWide": "/assets/projects/9-happyhomes/HAPPY-WIDE.png",
    "description": "This project was completed as part of my university studies. The brief was to create a brand identity for a fictional company called 'Happy Homes.' The company was a home renovation business that specialized in creating beautiful, functional, and sustainable homes. \n\n The brand identity included a logo, business cards, letterhead, and a style guide. The logo was designed to be simple, modern, and versatile. The business cards and letterhead were designed to be clean and professional, with a focus on the brand colours and typography. The style guide outlined the brand colours, typography, and logo usage guidelines. \n\n The project was completed over a 12-week period and was presented to a panel of industry professionals at the end of the semester.",
    "color": "#FFFFFF"
  },
  {
    "index": 9,
    "id": "10-monothermatic",
    "title": "UNIVERSITY PROJECT: Monothematic Publication",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1718878576/10-monothermatic/rhxticmmcauyfwyvuoim.png",
    "imageWide": "/assets/projects/10-monothermatic/monothermatic-wide.png",
    "description": "The essence of horror is evident at every turn of the page in this 38-page booklet, immersing the reader in a chilling experience. Delving into the realm of horror movies, the document intertwines intriguing information with unsettling imagery. The deliberate use of minimalistic and simple typography, juxtaposed against dark and harrowing visuals, aims to evoke a palpable sense of discomfort for the reader. \n\n The square format of the publication serves as a structured and formal contrast to the typically chaotic and conflicted theme of the horror genre. Amongst the paragraphs of text, full-page photo displays act as captivating spectacles, intensifying the overall impact of the text, and the information.",
    "color": "#FFFFFF"
  },
  {
    "index": 10,
    "id": "11-nicktoddrealestate",
    "title": "UNIVERSITY PROJECT: Nick Todd Real Estate",
    "imageSquare": "https://res.cloudinary.com/dga3phnwp/image/upload/v1719307049/nicktodd-square-comp_jmiqvk.png",
    "imageWide": "/assets/projects/11-nicktoddrealestate/nicktodd-wide.png",
    "description": "In this project, I embraced the task of crafting branding collateral for a self-selected organization - 'Nick Todd Real Estate,' a fictional company immersed in the ever-expanding real estate industry. My core aim was to cultivate a brand that not only radiated professionalism but also boasted distinctiveness and recognizability within the market. \n\n The focal point of our branding endeavor is the 'brand mark,' a clever composition featuring the silhouette of a house with the door cutout shaped as a pen tip. This thoughtful design encapsulates the nature of the business, symbolizing its property management focus through the house image, while the pen signifies the crucial act of contract signing. By integrating these elements, we aimed to create a visual identity that not only communicates the company's core functions but also resonates with clients and stakeholders, establishing a memorable presence in the real estate landscape. \n\n Choosing navy blue and yellow as the brand colors was intentional. Navy blue exudes trust and professionalism, while yellow adds a happy and welcoming touch. This complementary color scheme enhances the overall brand identity, creating a balanced and memorable visual impact for 'Nick Todd Real Estate.'",
    "color": "#FFFFFF"
  }
]
